apps/ledger-live-desktop/tests/userdata/accountSeiEvmStaking.json

{
  "data": {
    "PLAYWRIGHT_RUN": {
      "localStorage": {
        "acceptedTermsVersion": "2042-01-01"
      }
    },
    "settings": {
      "hasCompletedOnboarding": true,
      "counterValue": "USD",
      "language": "en",
      "theme": null,
      "region": null,
      "locale": "en-US",
      "orderAccounts": "balance|desc",
      "countervalueFirst": false,
      "autoLockTimeout": 10,
      "selectedTimeRange": "month",
      "marketIndicator": "western",
      "currenciesSettings": {},
      "pairExchanges": {},
      "developerMode": false,
      "loaded": true,
      "shareAnalytics": true,
      "sentryLogs": true,
      "lastUsedVersion": "99.99.99",
      "dismissedBanners": [],
      "accountsViewMode": "list",
      "showAccountsHelperBanner": true,
      "hideEmptyTokenAccounts": false,
      "sidebarCollapsed": false,
      "discreetMode": false,
      "preferredDeviceModel": "nanoSP",
      "hasInstalledApps": true,
      "hasAcceptedSwapKYC": false,
      "lastSeenDevice": {
        "modelId": "nanoSP",
        "deviceInfo": {
          "version": "1.0.2",
          "mcuVersion": "4.02",
          "seVersion": "1.0.2",
          "majMin": "1.0.2",
          "providerName": null,
          "targetId": 856686596,
          "hasDevFirmware": false,
          "seTargetId": 856686596,
          "isOSU": false,
          "isBootloader": false,
          "isRecoveryMode": false,
          "managerAllowed": false,
          "pinValidated": true,
          "onboarded": true,
          "bootloaderVersion": "3.12",
          "hardwareVersion": 0,
          "languageId": 0,
          "seFlags": []
        },
        "apps": []
      },
      "blacklistedTokenIds": [],
      "swapAcceptedProviderIds": [],
      "deepLinkUrl": null,
      "firstTimeLend": false,
      "swapProviders": [],
      "showClearCacheBanner": false,
      "starredAccountIds": [],
      "hasPassword": false
    },
    "user": {
      "id": "08cf3393-c5eb-4ea7-92de-0deea22e3971"
    },
    "accounts": [
      {
        "data": {
          "id": "js:2:sei_evm:0x6EB963EFD0FEF7A4CFAB6CE6F1421C3279D11707:",
          "seedIdentifier": "0x6EB963EFD0FEF7A4CFAB6CE6F1421C3279D11707",
          "name": "SEI Network (EVM) 1",
          "starred": false,
          "used": true,
          "derivationMode": "",
          "index": 0,
          "freshAddress": "0x6EB963EFD0FEF7A4CFAB6CE6F1421C3279D11707",
          "freshAddressPath": "44'/60'/0'/0/0",
          "blockHeight": 100000,
          "creationDate": "2024-01-01T00:00:00.000Z",
          "operationsCount": 0,
          "operations": [],
          "pendingOperations": [],
          "currencyId": "sei_evm",
          "unitMagnitude": 18,
          "lastSyncDate": "2024-01-01T00:00:00.000Z",
          "balance": "10000000000000000000",
          "spendableBalance": "10000000000000000000",
          "xpub": "0x6EB963EFD0FEF7A4CFAB6CE6F1421C3279D11707",
          "stakingResources": {
            "delegations": [],
            "redelegations": [],
            "unbondings": [],
            "delegatedBalance": "0",
            "pendingRewardsBalance": "0",
            "unbondingBalance": "0"
          },
          "swapHistory": []
        },
        "version": 1
      },
      {
        "data": {
          "id": "js:2:sei_evm:0x18E9A4F2A5A2B01F35E7D086E75D7D01530A1A9F:",
          "seedIdentifier": "0x6EB963EFD0FEF7A4CFAB6CE6F1421C3279D11707",
          "name": "SEI Network (EVM) Staked",
          "starred": false,
          "used": true,
          "derivationMode": "",
          "index": 1,
          "freshAddress": "0x18E9A4F2A5A2B01F35E7D086E75D7D01530A1A9F",
          "freshAddressPath": "44'/60'/1'/0/0",
          "blockHeight": 100000,
          "creationDate": "2024-01-01T00:00:00.000Z",
          "operationsCount": 0,
          "operations": [],
          "pendingOperations": [],
          "currencyId": "sei_evm",
          "unitMagnitude": 18,
          "lastSyncDate": "2024-01-01T00:00:00.000Z",
          "balance": "10000000000000000000",
          "spendableBalance": "7500000000000000000",
          "xpub": "0x18E9A4F2A5A2B01F35E7D086E75D7D01530A1A9F",
          "stakingResources": {
            "delegations": [
              {
                "validatorAddress": "seivaloper1mockvalidator000000000000000000000001",
                "amount": "2500000000000000000",
                "pendingRewards": "120000000000000000",
                "status": "bonded"
              }
            ],
            "redelegations": [
              {
                "validatorSrcAddress": "seivaloper1mockvalidator000000000000000000000002",
                "validatorDstAddress": "seivaloper1mockvalidator000000000000000000000003",
                "amount": "1000000000000000000",
                "completionDate": "2042-01-02T03:04:05.000Z"
              }
            ],
            "unbondings": [
              {
                "validatorAddress": "seivaloper1mockvalidator000000000000000000000001",
                "amount": "500000000000000000",
                "completionDate": "2042-01-02T03:04:05.000Z"
              }
            ],
            "delegatedBalance": "2500000000000000000",
            "pendingRewardsBalance": "120000000000000000",
            "unbondingBalance": "500000000000000000",
            "validators": [
              {
                "validatorAddress": "seivaloper1mockvalidator000000000000000000000001",
                "name": "Ledger by Figment",
                "votingPower": 0,
                "commission": 0.05,
                "estimatedYearlyRewardsRate": 0,
                "tokens": 123456789000000
              },
              {
                "validatorAddress": "seivaloper1mockvalidator000000000000000000000002",
                "name": "Chorus One",
                "votingPower": 1,
                "commission": 0.07,
                "estimatedYearlyRewardsRate": 0,
                "tokens": 99000000000000
              },
              {
                "validatorAddress": "seivaloper1mockvalidator000000000000000000000003",
                "name": "Everstake",
                "votingPower": 2,
                "commission": 0.1,
                "estimatedYearlyRewardsRate": 0,
                "tokens": 77000000000000
              }
            ]
          },
          "swapHistory": []
        },
        "version": 1
      }
    ]
  }
}
